"""unit 6"""
# List เพิ่ม แก้ไข ลบข้อมูล ได้
# a = [1,2,3,"jame"]
# print(a[2])
# a[3] = 5
# print(a)

#tuple เพิ่ม แก้ไข ลบข้อมูล ไม่ได้
# a = (1,2,3,"jame")
# print(a)

#set
# a = {"dog", "cat", "hamster"}
# b = {"bird", "dog", "zebra"}
# c = a.intersection(b)
# d = a.union(b)
# print(c)
# print(d)

#dic คือ key : value
# person = {
#     "name" : "Aim",
#     "age" : 18,
#     "favorite" : "dog"
#     }
# print(person["favorite"])

"""unit7 Operators (เครื่องหมาย)"""

##Assignment Operator

# + คือ บวกกัน ระหว่างตัวใดๆ
# (ถ้าเป็น str + str จะออกมาเป็นติดกัน)
# (ถ้าเป็น int + int จะออกมาเป็นผลบวกของตัวเลข)
# (ถ้าเป็น float + int จะออกมาเป็นผลบวกของตัวเลข แค่ผลจะเป็นfloatเสมอ)
# (แต่ๆๆๆถ้าเป็น str + int จะไม่สามารถทำแบบนี้ได้ ไม่งั้นเออเร่อ)

# - คือ ลบกัน ระหว่างตัวใดๆ
# (ถ้าเป็น str - str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int - int จะออกมาเป็นผลลบของตัวเลข)
# (ถ้าเป็น float - int จะออกมาเป็นผลลบของตัวเลข แค่ผลจะเป็นfloatเสมอ)
# (แต่ๆๆๆถ้าเป็น str - int จะไม่สามารถทำแบบนี้ได้ ไม่งั้นเออเร่อ)

# * คือ คูณกัน ระหว่างตัวใดๆ
# (ถ้าเป็น str * str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int * int จะออกมาเป็นผลคูณของตัวเลข)
# (ถ้าเป็น float * int จะออกมาเป็นผลคูณของตัวเลข แค่ผลจะเป็นfloatเสมอ)
# (ถ้าเป็น str * int ผลจะเป็นตัวข้อความซ้ำกับจำนวนตัวเลข)

# / คือ หารกัน ระหว่างตัวใดๆ
# (ถ้าเป็น str / str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int / int จะออกมาเป็นผลหารของตัวเลข แค่ผลจะเป็นfloatเสมอแม้จะหารลงตัว)
# (ถ้าเป็น float / int จะออกมาเป็นผลหารของตัวเลข แค่ผลจะเป็นfloatเสมอ)
# (ถ้าเป็น str / int แบบนี้ไม่มี ไม่สามารถทำได้)

# // คือ หารกัน ระหว่างตัวใดๆ แต่จะสนแค่ตัวที่หารได้ "ไม่สนเศษเหลือ"
# (ถ้าเป็น str // str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int // int จะออกมาเป็นผลหารของตัวเลข แต่จะเอาแค่ตัวที่หารได้ ไม่สนเศษ)
# (ถ้าเป็น float // int จะออกมาเป็นผลหารของตัวเลข แต่จะเอาแค่ตัวที่หารได้ ไม่สนเศษ แค่ผลจะเป็นfloatเสมอ)
# (ถ้าเป็น str // int แบบนี้ไม่มี ไม่สามารถทำได้)

# % คือ หารกัน ระหว่างตัวใดๆ แต่จะ"สนเศษเหลือ" จากที่หาร
# (ถ้าเป็น str % str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int % int จะออกมาเป็นผลหารของตัวเลข แต่จะเอาแค่เศษ)
# (ถ้าเป็น float % int จะออกมาเป็นผลหารของตัวเลข แต่จะเอาแค่เศษ แค่ผลจะเป็นfloatเสมอ)
# (ถ้าเป็น str % int แบบนี้ไม่มี ไม่สามารถทำได้)

# ** คือ เลขยกกำลัง
# (ถ้าเป็น str ** str แบบนี้ไม่มี ไม่สามารถทำได้)
# (ถ้าเป็น int ** int ผลยกกำลังเป็นจำนวนเต็ม)
# (ถ้าเป็น float ** int ผลยกกำลังจะเป็น float เสมอ)
# (ถ้าเป็น str ** int แบบนี้ไม่มี ไม่สามารถทำได้)


##Comparison Operator

# == เท่ากับ
# != ไม่เท่ากับ
# > มากกว่า
# >= มากกว่าหรือเท่ากับ
# < น้อยกว่า
# <= น้อยกว่าหรือเท่ากับ


#Logical Operator

# and และ
# or หรือ
# not นิเสธ


"""unit8 MATH"""

#พวกฟังก์ชันคณิตศาตร์ บางอันต้อง import math ก่อน

#Function             Meaning
# min()             หาค่าที่น้อยที่สุด
# max()             หาค่าที่มากที่สุด
# abs()             ถอดค่าสัมบูรณ์
# pow()             ยกกำลัง
# math.sqrt()       หาค่ารากที่สอง
# math.ceil()       ปัดทศนิยมขึ้น (แสดงผลเป็นจำนวนเต็ม) ให้จำเป็น ceil คือเพดาน มันปัดขึ้น
# math.floor()      ปัดทศนิยมลง (แสดงผลเป็นจำนวนเต็ม) ให้จำเป็น floor คือพื้น อยู่ล่าง มันปัดลง
# math.pi           3.141592653589793

# import math
# print(min(2,3,5))  >>> 2
# print(max(2,3,5))  >>> 5
# print(abs(-51)) >>> 51
# print(pow(4,3)) >>> 64 (4 ยกกำลัง 3)
# print(math.ceil(4.1)) >>> 5
# print(math.floor(4.1)) >>> 4

### พวกฟังก์ชันคณิตศาสตร์เพิ่มเติม บางอันต้อง import math ก่อน

#Function          Meaning
# sum()            หาผลรวมของข้อมูลที่เป็นกลุ่ม (เช่น list)
# round()          ปัดเศษทศนิยมตามหลักคณิตศาสตร์
# math.factorial() หาค่าแฟกทอเรียล (!n)
# math.gcd()       หาค่า ห.ร.ม. (หารร่วมมาก)
# math.lcm()       หาค่า ค.ร.น. (คูณร่วมน้อย)
# math.isqrt()     หารากที่สองแล้วปัดเศษลง (แสดงผลเป็นจำนวนเต็ม)
# math.fsum()      หาผลรวมของทศนิยมแบบแม่นยำสูง
# math.log()       หาค่า Natural Log (หรือกำหนดฐานเองได้)
# math.log10()     หาค่า Log ฐาน 10
# math.exp()       หาค่า e ยกกำลัง x
# math.sin()       หาค่า Sine ของมุม (หน่วยเรเดียน)
# math.cos()       หาค่า Cosine ของมุม (หน่วยเรเดียน)
# math.tan()       หาค่า Tangent ของมุม (หน่วยเรเดียน)
# math.radians()   แปลงมุมจากองศา ให้เป็น เรเดียน
# math.degrees()   แปลงมุมจากเรเดียน ให้เป็น องศา
# math.e           2.718281828459045 (ค่าคงที่ของออยเลอร์)
# math.inf         ค่าอนันต์ (Infinity)


"""unit9 BOOLEEN จริง/เท็จ"""

# 1 หรือเลขอะไรก็ได้หรือมากกว่านั้น และ อะไรที่เป็น string >>> True
# 0 หรือ stringที่ว่าง("") >>> False

# - ถ้าเชื่อมด้วย and ต้องเป็นจริงทั้งคู่ ถึงจะได้ผลลัพธ์เป็นจริง
# - ถ้าเชื่อมด้วย or ต้องเป็นเท็จทั้งคู่ ถึงจะได้ผลลัพธ์เป็นเท็จ นอกนั้นเป็นจริง
# - bool(0), bool("") จะได้ผลลัพธ์เป็นเท็จ นอกนั้นเป็นจริง

"""unit10 if/else เงื่อนไข"""

# เงื่อนไขต้องเป็นจริง จึงจะทำงาน
# if condition:
#     statement

a = 20
if a > 10:
    print("a is bigger than 10")